export const provinceList = [{
    "name": "安徽省",
    "city": [{
        "name": "安庆市",
        "districtAndCounty": ["枞阳县", "枞阳镇", "大观区", "孚玉镇", "高河镇", "怀宁县", "晋熙镇", "雷阳镇", "梅城镇", "潜山县", "宿松县", "太湖县", "天堂镇", "桐城市", "望江县", "宜秀区", "迎江区", "岳西县"]
    }, {
        "name": "蚌埠市",
        "districtAndCounty": ["蚌山区", "城关镇", "城关镇", "城关镇", "固镇县", "怀远县", "淮上区", "龙子湖区", "五河县", "禹会区"]
    }, {
        "name": "亳州市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "利辛县", "蒙城县", "谯城区", "涡阳县"]
    }, {
        "name": "巢湖市",
        "districtAndCounty": ["含山县", "和县", "环峰镇", "居巢区", "历阳镇", "庐城镇", "庐江县", "无城镇", "无为县"]
    }, {
        "name": "池州市",
        "districtAndCounty": ["东至县", "贵池区", "七里镇", "青阳县", "蓉城镇", "石台县", "尧渡镇"]
    }, {
        "name": "滁州市",
        "districtAndCounty": ["定城镇", "定远县", "凤阳县", "府城镇", "来安县", "琅区", "明光市", "南谯区", "全椒县", "天长市", "襄河镇", "新安镇"]
    }, {
        "name": "阜阳市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "阜南县", "界首市", "临泉县", "慎城镇", "太和县", "颍东区", "颍泉区", "颍上县", "颍州区"]
    }, {
        "name": "合肥市",
        "districtAndCounty": ["包河区", "店埠镇", "肥东县", "肥西县", "庐阳区", "上派镇", "蜀山区", "水湖镇", "瑶海区", "长丰县"]
    }, {
        "name": "淮北市",
        "districtAndCounty": ["杜集区", "烈山区", "濉溪县", "濉溪镇", "相山区"]
    }, {
        "name": "淮南市",
        "districtAndCounty": ["八公山区", "城关镇", "大通区", "凤台县", "潘集区", "田家庵区", "谢家集区"]
    }, {
        "name": "黄山市",
        "districtAndCounty": ["碧阳镇", "海阳镇", "黄山区", "徽城镇", "徽州区", "祁门县", "祁山镇", "歙县", "屯溪区", "休宁县", "黟县"]
    }, {
        "name": "六安市",
        "districtAndCounty": ["城关镇", "城关镇", "衡山镇", "霍邱县", "霍山县", "金安区", "金寨县", "梅山镇", "寿春镇", "寿县", "舒城县", "裕安区"]
    }, {
        "name": "马鞍山市",
        "districtAndCounty": ["当涂县", "姑孰镇", "花山区", "金家庄区", "雨山区"]
    }, {
        "name": "宿州市",
        "districtAndCounty": ["砀城镇", "砀山县", "灵璧县", "灵城镇", "龙城镇", "泗城镇", "泗县", "萧县", "埇桥区"]
    }, {
        "name": "铜陵市",
        "districtAndCounty": ["郊区", "狮子山区", "铜官山区", "铜陵县", "五松镇"]
    }, {
        "name": "芜湖市",
        "districtAndCounty": ["繁昌县", "繁阳镇", "籍山镇", "镜湖区", "鸠江区", "南陵县", "三山区", "湾镇", "芜湖县", "弋江区"]
    }, {
        "name": "宣城市",
        "districtAndCounty": ["广德县", "华阳镇", "绩溪县", "建平镇", "泾川镇", "泾县", "旌德县", "旌阳镇", "郎溪县", "宁国市", "桃州镇", "宣州区"]
    }]
}, {
    "name": "澳门",
    "city": [{
        "name": "澳门特别行政区",
        "districtAndCounty": ["澳门特别行政区"]
    }]
}, {
    "name": "北京市",
    "city": [{
        "name": "北京市",
        "districtAndCounty": ["昌平区", "朝阳区", "崇文区", "大兴区", "东城区", "房山区", "丰台区", "海淀区", "怀柔区", "门头沟区", "密云县", "平谷区", "石景山区", "顺义区", "通州区", "西城区", "宣武区", "延庆县", "延庆镇"]
    }]
}, {
    "name": "重庆市",
    "city": [{
        "name": "重庆市",
        "districtAndCounty": ["巴南区", "北碚区", "璧山县", "城口县", "大渡口区", "大足县", "垫江县", "丰都县", "奉节县", "涪陵区", "合川市", "江北区", "江津市", "九龙坡区", "开县", "梁平县", "南岸区", "南川市", "彭水苗族土家族自治县", "綦江县", "黔江区", "荣昌县", "沙坪坝区", "石柱土家族自治县", "双桥区", "铜梁县", "潼南县", "万盛区", "万州区", "巫山县", "巫溪县", "武隆县", "秀山土家族苗族自治县", "永川区市", "酉阳土家族苗族自治县", "渝北区", "渝中区", "云阳县", "长寿区", "忠县"]
    }]
}, {
    "name": "福建省",
    "city": [{
        "name": "福州市",
        "districtAndCounty": ["仓山区", "凤城镇", "凤山镇", "福清市", "鼓楼区", "晋安区", "连江县", "罗源县", "马尾区", "梅城镇", "闽侯县", "闽清县", "平潭县", "台江区", "潭城镇", "永泰县", "樟城镇", "长乐市"]
    }, {
        "name": "龙岩市",
        "districtAndCounty": ["凤城镇", "连城县", "莲峰镇", "临江镇", "平川镇", "上杭县", "汀州镇", "武平县", "新罗区", "永定县", "漳平市", "长汀县"]
    }, {
        "name": "南平市",
        "districtAndCounty": ["光泽县", "杭川镇", "建瓯市", "建阳市", "浦城县", "邵武市", "顺昌县", "松溪县", "松源镇", "武夷山市", "熊山镇", "延平区", "政和县"]
    }, {
        "name": "宁德市",
        "districtAndCounty": ["鳌阳镇", "福安市", "福鼎市", "古峰镇", "古田县", "蕉城区", "屏南县", "狮城镇", "寿宁县", "双城镇", "霞浦县", "柘荣县", "周宁县"]
    }, {
        "name": "莆田市",
        "districtAndCounty": ["城厢区", "涵江区", "荔城区", "仙游县", "秀屿区"]
    }, {
        "name": "泉州市",
        "districtAndCounty": ["☆", "安溪县", "德化县", "丰泽区", "凤城镇", "惠安县", "金门县", "晋江市", "鲤城区", "螺城镇", "洛江区", "南安市", "泉港区", "石狮市", "桃城镇", "浔中镇", "永春县"]
    }, {
        "name": "三明市",
        "districtAndCounty": ["城关镇", "翠江镇", "大田县", "古镛镇", "建宁县", "将乐县", "均溪镇", "龙津镇", "梅列区", "明溪县", "宁化县", "清流县", "三元区", "沙县", "杉城镇", "濉城镇", "泰宁县", "雪峰镇", "永安市", "尤溪县"]
    }, {
        "name": "厦门市",
        "districtAndCounty": ["海沧区", "湖里区", "集美区", "思明区", "同安区", "翔安区"]
    }, {
        "name": "漳州市",
        "districtAndCounty": ["东山县", "华安县", "华丰镇", "龙海市", "龙文区", "南靖县", "南诏镇", "平和县", "山城镇", "绥安镇", "武安镇", "西埔镇", "芗城区", "小溪镇", "云陵镇", "云霄县", "漳浦县", "长泰县", "诏安县"]
    }]
}, {
    "name": "甘肃省",
    "city": [{
        "name": "白银市",
        "districtAndCounty": ["白银区", "会宁县", "会师镇", "景泰县", "靖远县", "平川区", "乌兰镇", "一条山镇"]
    }, {
        "name": "定西市",
        "districtAndCounty": ["安定区", "巩昌镇", "临洮县", "陇西县", "岷县", "岷阳镇", "平襄镇", "清源镇", "洮阳镇", "通渭县", "渭源县", "武阳镇", "漳县"]
    }, {
        "name": "甘南州",
        "districtAndCounty": ["城关镇", "城关镇", "电尕镇", "迭部县", "合作市", "拉卜楞镇", "临潭县", "柳林镇", "碌曲县", "玛艾镇", "玛曲县", "尼玛镇", "夏河县", "舟曲县", "卓尼县"]
    }, {
        "name": "嘉峪关市",
        "districtAndCounty": ["城关镇", "金昌市", "金川区", "永昌县"]
    }, {
        "name": "酒泉市",
        "districtAndCounty": ["阿克塞哈萨克族自治县", "安西县", "党城湾镇", "敦煌市", "红柳湾镇", "金塔县", "金塔镇", "肃北蒙古族自治县", "肃州区", "玉门市", "渊泉镇"]
    }, {
        "name": "兰州市",
        "districtAndCounty": ["安宁区", "城关区", "城关镇", "城关镇", "皋兰县", "红古区", "七里河区", "石洞镇", "西固区", "永登县", "榆中县"]
    }, {
        "name": "临夏州",
        "districtAndCounty": ["城关镇", "城关镇", "吹麻滩镇", "东乡族自治县", "附城镇", "广河县", "韩集镇", "和政县", "积石山保安族东乡族撒拉族自治县", "康乐县", "临夏市", "临夏县", "刘家峡镇", "锁南坝镇", "永靖县"]
    }, {
        "name": "陇南市",
        "districtAndCounty": ["成县", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "宕昌县", "汉源镇", "徽县", "康县", "礼县", "两当县", "文县", "武都区", "西和县"]
    }, {
        "name": "平凉市",
        "districtAndCounty": ["城关镇", "城关镇", "崇信县", "东华镇", "华亭县", "锦屏镇", "泾川县", "静宁县", "崆峒区", "灵台县", "水洛镇", "中台镇", "庄浪县"]
    }, {
        "name": "庆阳市",
        "districtAndCounty": ["城关镇", "合水县", "华池县", "环城镇", "环县", "宁县", "庆城县", "庆城镇", "柔远镇", "山河镇", "西峰区", "西华池镇", "新宁镇", "镇原县", "正宁县"]
    }, {
        "name": "天水市",
        "districtAndCounty": ["城关镇", "大像山镇", "甘谷县", "麦积区", "秦安县", "秦州区", "清水县", "武山县", "兴国镇", "永清镇", "张家川回族自治县", "张家川镇"]
    }, {
        "name": "武威市",
        "districtAndCounty": ["城关镇", "古浪县", "古浪镇", "华藏寺镇", "凉州区", "民勤县", "天祝藏族自治县"]
    }, {
        "name": "张掖市",
        "districtAndCounty": ["城关镇", "甘州区", "高台县", "红湾寺镇", "洪水镇", "临泽县", "民乐县", "清泉镇", "沙河镇", "山丹县", "肃南裕固族自治县"]
    }]
}, {
    "name": "广东省",
    "city": [{
        "name": "潮州市",
        "districtAndCounty": ["庵埠镇", "潮安县", "黄冈镇", "饶平县", "湘桥区"]
    }, {
        "name": "东莞市",
        "districtAndCounty": []
    }, {
        "name": "佛山市",
        "districtAndCounty": ["禅城区", "高明区", "南海区", "三水区", "顺德区"]
    }, {
        "name": "广州市",
        "districtAndCounty": ["白云区", "从化市", "番禺区", "海珠区", "花都区", "黄埔区", "荔湾区", "萝岗区", "南沙区", "天河区", "越秀区", "增城市"]
    }, {
        "name": "河源市",
        "districtAndCounty": ["东源县", "和平县", "老隆镇", "连平县", "龙川县", "仙塘镇", "阳明镇", "元善镇", "源城区", "紫城镇", "紫金县"]
    }, {
        "name": "惠州市",
        "districtAndCounty": ["博罗县", "惠城区", "惠东县", "惠阳区", "龙门县", "罗阳镇"]
    }, {
        "name": "江门市",
        "districtAndCounty": ["恩平市", "鹤山市", "江海区", "开平市", "蓬江区", "台山市", "新会区"]
    }, {
        "name": "揭阳市",
        "districtAndCounty": ["河婆镇", "惠城镇", "惠来县", "揭东县", "揭西县", "普宁市", "曲溪镇", "榕城区"]
    }, {
        "name": "茂名市",
        "districtAndCounty": ["电白县", "高州市", "化州市", "茂港区", "茂南区", "水东镇", "信宜市"]
    }, {
        "name": "梅州市",
        "districtAndCounty": ["程江镇", "大埔县", "大柘镇", "丰顺县", "湖寮镇", "蕉城镇", "蕉岭县", "梅江区", "梅县", "平远县", "水寨镇", "汤坑镇", "五华县", "兴宁市"]
    }, {
        "name": "清远市",
        "districtAndCounty": ["佛冈县", "吉田镇", "连南瑶族自治县", "连山壮族瑶族自治县", "连州市", "清城区", "清新县", "三江镇", "石角镇", "太和镇", "阳城镇", "阳山县", "英德市"]
    }, {
        "name": "汕头市",
        "districtAndCounty": ["潮南区", "潮阳区", "澄海区", "濠江区", "后宅镇", "金平区", "龙湖区", "南澳县"]
    }, {
        "name": "汕尾市",
        "districtAndCounty": ["城区", "海城镇", "海丰县", "河田镇", "陆丰市", "陆河县"]
    }, {
        "name": "韶关市",
        "districtAndCounty": ["乐昌市", "龙仙镇", "南雄市", "曲江区", "仁化县", "仁化镇", "乳城镇", "乳源瑶族自治县", "始兴县", "太平镇", "翁源县", "武江区", "新丰县", "浈江区"]
    }, {
        "name": "深圳市",
        "districtAndCounty": ["宝安区", "福田区", "龙岗区", "罗湖区", "南山区", "盐田区"]
    }, {
        "name": "阳江市",
        "districtAndCounty": ["东城镇", "江城区", "阳春市", "阳东县", "阳西县", "织镇"]
    }, {
        "name": "云浮市",
        "districtAndCounty": ["都城镇", "六都镇", "罗定市", "新城镇", "新兴县", "郁南县", "云安县", "云城区"]
    }, {
        "name": "湛江市",
        "districtAndCounty": ["撤销广州市东山区", "赤坎区", "芳村区", "雷州市", "廉江市", "萝岗区", "麻章区", "坡头区", "设立广州市南沙区", "遂城镇", "遂溪县", "吴川市", "霞山区", "徐闻县"]
    }, {
        "name": "肇庆市",
        "districtAndCounty": ["德庆县", "鼎湖区", "端州区", "封开县", "高要市", "广宁县", "怀城镇", "怀集县", "江口镇", "南街镇", "四会市"]
    }, {
        "name": "中山市",
        "districtAndCounty": []
    }, {
        "name": "珠海市",
        "districtAndCounty": ["斗门区", "金湾区", "香洲区"]
    }]
}, {
    "name": "广西",
    "city": [{
        "name": "百色市",
        "districtAndCounty": ["八达镇", "城关镇", "城厢镇", "德保县", "靖西县", "乐里镇", "乐业县", "凌云县", "隆林各族自治县", "马头镇", "那坡县", "平果县", "平马镇", "泗城镇", "田东县", "田林县", "田阳县", "田州镇", "同乐镇", "西林县", "新靖镇", "新州镇", "右江区"]
    }, {
        "name": "北海市",
        "districtAndCounty": ["海城区", "合浦县", "廉州镇", "铁山港区", "银海区"]
    }, {
        "name": "崇左市",
        "districtAndCounty": ["城中镇", "大新县", "扶绥县", "江州区", "龙州县", "龙州镇", "宁明县", "凭祥市", "桃城镇", "天等县", "天等镇", "新宁镇"]
    }, {
        "name": "防城港市",
        "districtAndCounty": ["东兴市", "防城区", "港口区", "上思县", "思阳镇"]
    }, {
        "name": "贵港市",
        "districtAndCounty": ["港北区", "港南区", "桂平市", "平南县", "平南镇", "覃塘区"]
    }, {
        "name": "桂林市",
        "districtAndCounty": ["叠彩区", "恭城瑶族自治县", "恭城镇", "灌阳县", "灌阳镇", "荔城镇", "荔浦县", "临桂县", "临桂镇", "灵川县", "灵川镇", "龙胜各族自治县", "龙胜镇", "平乐县", "平乐镇", "七星区", "全州县", "全州镇", "象山区", "兴安县", "兴安镇", "秀峰区", "雁山区", "阳朔县", "阳朔镇", "永福县", "永福镇", "资源县", "资源镇"]
    }, {
        "name": "河池市",
        "districtAndCounty": ["安阳镇", "巴马瑶族自治县", "巴马镇", "城关镇", "大化瑶族自治县", "大化镇", "东兰县", "东兰镇", "东门镇", "都安瑶族自治县", "凤城镇", "凤山县", "环江毛南族自治县", "金城江区", "六排镇", "罗城仫佬族自治县", "南丹县", "思恩镇", "天峨县", "宜州市"]
    }, {
        "name": "贺州市",
        "districtAndCounty": ["八步区", "富川瑶族自治县", "富阳镇", "昭平县", "昭平镇", "钟山县", "钟山镇"]
    }, {
        "name": "来宾市",
        "districtAndCounty": ["城关镇", "合山市", "金秀瑶族自治县", "金秀镇", "武宣县", "武宣镇", "象州县", "象州镇", "忻城县", "兴宾区"]
    }, {
        "name": "柳州市",
        "districtAndCounty": ["城中区", "大埔镇", "古宜镇", "拉堡镇", "柳北区", "柳城县", "柳江县", "柳南区", "鹿寨县", "鹿寨镇", "融安县", "融水苗族自治县", "融水镇", "三江侗族自治县", "鱼峰区", "长安镇"]
    }, {
        "name": "南宁市",
        "districtAndCounty": ["宾阳县", "横县", "江南区", "良庆区", "隆安县", "马山县", "青秀区", "上林县", "武鸣县", "西乡塘区", "兴宁区", "邕宁区"]
    }, {
        "name": "钦州市",
        "districtAndCounty": ["灵城镇", "灵山县", "浦北县", "钦北区", "钦南区", "小江镇"]
    }, {
        "name": "梧州市",
        "districtAndCounty": ["苍梧县", "岑溪市", "蝶山区", "龙圩镇", "蒙山县", "蒙山镇", "藤县", "藤州镇", "万秀区", "长洲区"]
    }, {
        "name": "玉林市",
        "districtAndCounty": ["北流市", "博白县", "博白镇", "陆城镇", "陆川县", "容县", "容州镇", "石南镇", "兴业县", "玉州区"]
    }]
}, {
    "name": "贵州省",
    "city": [{
        "name": "安顺市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "关岭布依族苗族自治县", "关索镇", "平坝县", "普定县", "松山镇", "西秀区", "镇宁布依族苗族自治县", "紫云苗族布依族自治县"]
    }, {
        "name": "毕节地区",
        "districtAndCounty": ["毕节市", "草海镇", "城关镇", "城关镇", "城关镇", "城关镇", "大方县", "大方镇", "赫章县", "金沙县", "纳雍县", "黔西县", "威宁彝族回族苗族自治县", "雍熙镇", "织金县"]
    }, {
        "name": "贵阳市",
        "districtAndCounty": ["白云区", "城关镇", "花溪区", "开阳县", "龙场镇", "南明区", "清镇市", "乌当区", "息烽县", "小河区", "修文县", "永靖镇", "云岩区"]
    }, {
        "name": "六盘水市",
        "districtAndCounty": ["红果镇", "六枝特区", "盘县", "平寨镇", "水城县", "钟山区"]
    }, {
        "name": "黔东南州",
        "districtAndCounty": ["八弓镇", "丙妹镇", "岑巩县", "城关镇", "从江县", "丹江镇", "丹寨县", "德凤镇", "凤城镇", "革东镇", "古州镇", "黄平县", "剑河县", "锦屏县", "凯里市", "雷山县", "黎平县", "龙泉镇", "麻江县", "榕江县", "三江镇", "三穗县", "施秉县", "思旸镇", "台拱镇", "台江县", "天柱县", "新州镇", "杏山镇", "阳镇", "镇远县"]
    }, {
        "name": "黔南州",
        "districtAndCounty": ["城关镇", "城关镇", "都匀市", "独山县", "福泉市", "贵定县", "和平镇", "惠水县", "荔波县", "龙里县", "龙坪镇", "龙山镇", "罗甸县", "平湖镇", "平塘县", "三都水族自治县", "三合镇", "瓮安县", "雍阳镇", "玉屏镇", "长顺县", "长寨镇"]
    }, {
        "name": "黔西南州",
        "districtAndCounty": ["安龙县", "册亨县", "城关镇", "复兴镇", "莲城镇", "珉谷镇", "盘水镇", "普安县", "晴隆县", "望谟县", "新安镇", "兴仁县", "兴义市", "者楼镇", "贞丰县"]
    }, {
        "name": "铜仁地区",
        "districtAndCounty": ["德江县", "峨岭镇", "和平镇", "江口县", "蓼皋镇", "平溪镇", "青龙镇", "石阡县", "双江镇", "思南县", "思唐镇", "松桃苗族自治县", "汤山镇", "铜仁市", "万山特区", "万山镇", "沿河土家族自治县", "印江土家族苗族自治县", "玉屏侗族自治县"]
    }, {
        "name": "遵义市",
        "districtAndCounty": ["白泥镇", "赤水市", "道真仡佬族苗族自治县", "东皇镇", "都濡镇", "凤冈县", "凤仪镇", "红花岗区", "汇川区", "龙泉镇", "娄山关镇", "湄江镇", "湄潭县", "南白镇", "仁怀市", "绥阳县", "桐梓县", "务川仡佬族苗族自治县", "习水县", "洋川镇", "余庆县", "玉溪镇", "正安县", "遵义县"]
    }]
}, {
    "name": "海南省",
    "city": [{
        "name": "海口市",
        "districtAndCounty": ["龙华区", "美兰区", "琼山区", "秀英区"]
    }, {
        "name": "三亚市",
        "districtAndCounty": []
    }, {
        "name": "省直辖行政单位",
        "districtAndCounty": ["白沙黎族自治县", "保城镇", "保亭黎族苗族自治县", "抱由镇", "昌江黎族自治县", "澄迈县", "儋州市", "定安县", "定城镇", "东方市", "金江镇", "乐东黎族自治县", "临城镇", "临高县", "陵水黎族自治县", "琼海市", "琼中黎族苗族自治县", "石碌镇", "屯昌县", "屯城镇", "万宁市", "文昌市", "五指山市", "牙叉镇", "椰林镇", "营根镇"]
    }]
}, {
    "name": "河北省",
    "city": [{
        "name": "保定市",
        "districtAndCounty": ["安国市", "安肃镇", "安新县", "安新镇", "北市区", "博陵镇", "博野县", "定兴县", "定兴镇", "定州市", "阜平县", "阜平镇", "高碑店市", "高阳县", "高阳镇", "恒州镇", "涞水县", "涞水镇", "涞源县", "涞源镇", "蠡吾镇", "蠡县", "满城县", "满城镇", "南市区", "蒲阳镇", "清苑县", "清苑镇", "曲阳县", "仁厚镇", "容城县", "容城镇", "顺平县", "唐县", "望都县", "望都镇", "新市区", "雄县", "雄州镇", "徐水县", "易县", "易州镇", "涿州市"]
    }, {
        "name": "沧州市",
        "districtAndCounty": ["沧县", "沧州市新华区", "东光县", "东光镇", "海兴县", "河间市", "黄骅市", "乐寿镇", "孟村回族自治县", "孟村镇", "南皮县", "南皮镇", "泊头市", "青县", "清州镇", "任丘市", "桑园镇", "苏基镇", "肃宁县", "肃宁镇", "吴桥县", "献县", "新华区", "盐山县", "盐山镇", "运河区"]
    }, {
        "name": "承德市",
        "districtAndCounty": ["承德县", "大阁镇", "丰宁满族自治县", "宽城满族自治县", "宽城镇", "隆化县", "隆化镇", "滦平县", "滦平镇", "平泉县", "平泉镇", "双滦区", "双桥区", "围场满族蒙古族自治县", "围场镇", "下板城镇", "兴隆县", "兴隆镇", "鹰手营子矿区"]
    }, {
        "name": "邯郸市",
        "districtAndCounty": ["成安县", "成安镇", "磁县", "磁州镇", "丛台区", "大名县", "大名镇", "肥乡县", "肥乡镇", "峰峰矿区", "复兴区", "馆陶县", "馆陶镇", "广平县", "广平镇", "邯郸县", "邯山区", "鸡泽县", "鸡泽镇", "临洺关镇", "临漳县", "临漳镇", "南堡乡东小屯村", "邱县", "曲周县", "曲周镇", "涉城镇", "涉县", "魏城镇", "魏县", "武安市", "新马头镇", "永年县"]
    }, {
        "name": "衡水市",
        "districtAndCounty": ["安平县", "安平镇", "阜城县", "阜城镇", "故城县", "冀州市", "景县", "景州镇", "饶阳县", "饶阳镇", "深州市", "桃城区", "武强县", "武强镇", "武邑县", "武邑镇", "枣强县", "枣强镇", "郑口镇"]
    }, {
        "name": "廊坊市",
        "districtAndCounty": ["安次区", "霸州市", "大厂回族自治县", "大厂镇", "大城县", "固安县", "固安镇", "广阳区", "平舒镇", "三河市", "淑阳镇", "文安县", "文安镇", "香河县", "永清县", "永清镇"]
    }, {
        "name": "秦皇岛市",
        "districtAndCounty": ["北戴河区", "昌黎县", "昌黎镇", "抚宁县", "抚宁镇", "海港区", "卢龙县", "卢龙镇", "青龙满族自治县", "青龙镇", "山海关区"]
    }, {
        "name": "石家庄市",
        "districtAndCounty": ["高邑县", "高邑镇", "藁城市", "槐阳镇", "晋州市", "井陉矿区", "井陉县", "灵寿县", "灵寿镇", "龙州镇", "鹿泉市", "栾城县", "栾城镇", "平山县", "平山镇", "桥东区", "桥西区", "深泽县", "深泽镇", "微水镇", "无极县", "无极镇", "辛集市", "新华区", "新乐市", "行唐县", "裕华区", "元氏县", "赞皇县", "赞皇镇", "长安区", "赵县", "赵州镇", "正定县", "正定镇"]
    }, {
        "name": "唐山市",
        "districtAndCounty": ["倴城镇", "丰南区", "丰润区", "古冶区", "开平区", "乐亭县", "乐亭镇", "路北区", "路南区", "滦南县", "滦县", "滦州镇", "迁安市", "迁西县", "唐海县", "唐海镇", "兴城镇", "玉田县", "玉田镇", "遵化市"]
    }, {
        "name": "邢台市",
        "districtAndCounty": ["柏乡县", "柏乡镇", "丰州镇", "凤凰镇", "葛仙庄镇", "广宗县", "广宗镇", "和阳镇", "巨鹿县", "巨鹿镇", "临城县", "临城镇", "临西县", "临西镇", "隆尧县", "隆尧镇", "洺州镇", "南宫市", "南和县", "内丘县", "内丘镇", "宁晋县", "平乡县", "桥东区", "桥西区", "清河县", "任城镇", "任县", "沙河市", "威县", "新河县", "新河镇", "邢台市桥东区", "邢台县"]
    }, {
        "name": "张家口市",
        "districtAndCounty": ["柴沟堡镇", "赤城县", "赤城镇", "崇礼县", "沽源县", "怀安县", "怀来县", "康保县", "康保镇", "孔家庄镇", "南壕堑镇", "平定堡镇", "桥东区", "桥西区", "沙城镇", "尚义县", "万全县", "蔚县", "蔚州镇", "西城镇", "西湾子镇", "下花园区", "宣化区", "宣化县", "阳原县", "张北县", "张北镇", "张家口市宣化区", "涿鹿县", "涿鹿镇"]
    }]
}, {
    "name": "河南省",
    "city": [{
        "name": "安阳市",
        "districtAndCounty": ["安阳市北关区", "安阳县", "北关区", "城关镇", "城关镇", "道口镇", "滑县", "林州市", "龙安区", "内黄县", "汤阴县", "文峰区", "殷都区"]
    }, {
        "name": "鹤壁市",
        "districtAndCounty": ["朝歌镇", "城关镇", "鹤山区", "浚县", "淇滨区", "淇县", "山城区"]
    }, {
        "name": "济源市",
        "districtAndCounty": []
    }, {
        "name": "焦作市",
        "districtAndCounty": ["博爱县", "城关镇", "解放区", "马村区", "孟州市", "木城镇", "沁阳市", "清化镇", "山阳区", "温泉镇", "温县", "武陟县", "修武县", "中站区"]
    }, {
        "name": "开封市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "鼓楼区", "金明区", "开封县", "兰考县", "龙亭区", "杞县", "顺河回族区", "通许县", "尉氏县", "禹王台区"]
    }, {
        "name": "洛阳市",
        "districtAndCounty": ["瀍河回族区", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "吉利区", "涧西区", "老城区", "栾川县", "洛龙区", "洛宁县", "孟津县", "汝阳县", "嵩县", "西工区", "新安县", "偃师市", "伊川县", "宜阳县"]
    }, {
        "name": "漯河市",
        "districtAndCounty": ["城关镇", "临颍县", "舞泉镇", "舞阳县", "郾城区", "源汇区", "召陵区"]
    }, {
        "name": "南阳市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "邓州市", "方城县", "南召县", "内乡县", "赊店镇", "社旗县", "唐河县", "桐柏县", "宛城区", "卧龙区", "西峡县", "淅川县", "新野县", "镇平县"]
    }, {
        "name": "平顶山市",
        "districtAndCounty": ["宝丰县", "城关镇", "城关镇", "郏县", "昆阳镇", "鲁山县", "鲁阳镇", "汝州市", "石龙区", "卫东区", "舞钢市", "新华区", "叶县", "湛河区"]
    }, {
        "name": "濮阳市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "范县", "华龙区", "南乐县", "濮阳县", "清丰县", "台前县"]
    }, {
        "name": "三门峡市",
        "districtAndCounty": ["城关镇", "城关镇", "大营镇", "湖滨区", "灵宝市", "卢氏县", "渑池县", "陕县", "义马市"]
    }, {
        "name": "商丘市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "梁园区", "民权县", "宁陵县", "睢县", "睢阳区", "夏邑县", "永城市", "虞城县", "柘城县"]
    }, {
        "name": "新乡市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "封丘县", "凤泉区", "红旗区", "辉县市", "获嘉县", "牧野区", "卫滨区", "卫辉市", "新乡市红旗区", "新乡县", "延津县", "原阳县", "长垣县"]
    }, {
        "name": "信阳市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "固始县", "光山县", "河区", "淮滨县", "潢川县", "罗山县", "平桥区", "商城县", "息县", "新集镇", "新县"]
    }, {
        "name": "许昌市",
        "districtAndCounty": ["安陵镇", "城关镇", "魏都区", "襄城县", "许昌市魏都区", "许昌县", "鄢陵县", "禹州市", "长葛市"]
    }, {
        "name": "郑州市",
        "districtAndCounty": ["城关镇", "登封市", "二七区", "巩义市", "管城回族区", "惠济区", "金水区", "上街区", "新密市", "新郑市", "荥阳市", "中牟县", "中原区"]
    }, {
        "name": "周口市",
        "districtAndCounty": ["沈丘县", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "川汇区", "郸城县", "扶沟县", "淮阳县", "槐店镇", "鹿邑县", "商水县", "太康县", "西华县", "项城市"]
    }, {
        "name": "驻马店市",
        "districtAndCounty": ["蔡都镇", "古槐镇", "古吕镇", "泌水镇", "泌阳县", "盘龙镇", "平舆县", "灈阳镇", "确山县", "汝南县", "汝宁镇", "上蔡县", "遂平县", "西平县", "新蔡县", "驿城区", "真阳镇", "正阳县"]
    }]
}, {
    "name": "黑龙江省",
    "city": [{
        "name": "大庆市",
        "districtAndCounty": ["大同区", "杜尔伯特蒙古族自治县", "红岗区", "林甸县", "林甸镇", "龙凤区", "让胡路区", "萨尔图区", "泰康镇", "肇源县", "肇源镇", "肇州县", "肇州镇"]
    }, {
        "name": "大兴安岭地区",
        "districtAndCounty": ["呼玛县", "呼玛镇", "漠河县", "塔河县", "塔河镇", "西林吉镇"]
    }, {
        "name": "哈尔滨市",
        "districtAndCounty": ["阿城市", "巴彦县", "巴彦镇", "宾县", "宾州镇", "道里区", "道外区", "动力区", "方正县", "方正镇", "呼兰区", "木兰县", "木兰镇", "南岗区", "平房区", "尚志市", "双城市", "松北区", "通河县", "通河镇", "五常市", "香坊区", "延寿县", "延寿镇", "依兰县", "依兰镇"]
    }, {
        "name": "鹤岗市",
        "districtAndCounty": ["东山区", "凤翔镇", "工农区", "萝北县", "南山区", "绥滨县", "绥滨镇", "向阳区", "兴安区", "兴山区"]
    }, {
        "name": "黑河市",
        "districtAndCounty": ["爱辉区", "北安市", "边疆镇", "嫩江县", "嫩江镇", "孙吴县", "孙吴镇", "五大连池市", "逊克县"]
    }, {
        "name": "鸡西市",
        "districtAndCounty": ["城子河区", "滴道区", "恒山区", "虎林市", "鸡东县", "鸡东镇", "鸡冠区", "梨树区", "麻山区", "密山市"]
    }, {
        "name": "佳木斯市",
        "districtAndCounty": ["东风区", "抚远县", "抚远镇", "富锦市", "桦川县", "桦南县", "桦南镇", "郊区", "前进区", "汤原县", "汤原镇", "同江市", "向阳区", "永红区", "悦来镇"]
    }, {
        "name": "牡丹江市",
        "districtAndCounty": ["爱民区", "东安区", "东宁县", "东宁镇", "海林市", "林口县", "林口镇", "穆棱市", "宁安市", "绥芬河市", "西安区", "阳明区"]
    }, {
        "name": "七台河市",
        "districtAndCounty": ["勃利县", "勃利镇", "茄子河区", "桃山区", "新兴区"]
    }, {
        "name": "齐齐哈尔市",
        "districtAndCounty": ["昂昂溪区", "拜泉县", "拜泉镇", "富拉尔基区", "富裕县", "富裕镇", "甘南县", "甘南镇", "建华区", "克东县", "克东镇", "克山县", "克山镇", "龙江县", "龙江镇", "龙沙区", "梅里斯达斡尔族区", "讷河市", "碾子山区", "泰来县", "泰来镇", "铁锋区", "依安县", "依安镇"]
    }, {
        "name": "双鸭山市",
        "districtAndCounty": ["宝清县", "宝清镇", "宝山区", "福利镇", "集贤县", "尖山区", "岭东区", "饶河县", "饶河镇", "四方台区", "友谊县", "友谊镇"]
    }, {
        "name": "绥化市",
        "districtAndCounty": ["安达市", "北林区", "海伦市", "兰西县", "兰西镇", "明水县", "明水镇", "青冈县", "青冈镇", "庆安县", "庆安镇", "绥棱县", "绥棱镇", "望奎县", "望奎镇", "肇东市"]
    }, {
        "name": "伊春市",
        "districtAndCounty": ["朝阳镇", "翠峦区", "带岭区", "红星区", "嘉荫县", "金山屯区", "美溪区", "南岔区", "上甘岭区", "汤旺河区", "铁力市", "乌马河区", "乌伊岭区", "五营区", "西林区", "新青区", "伊春区", "友好区"]
    }]
}, {
    "name": "湖北省",
    "city": [{
        "name": "鄂州市",
        "districtAndCounty": ["鄂城区", "华容区", "梁子湖区"]
    }, {
        "name": "恩施州",
        "districtAndCounty": ["巴东县", "恩施市", "高乐山镇", "鹤峰县", "建始县", "来凤县", "利川市", "容美镇", "咸丰县", "翔凤镇", "信陵镇", "宣恩县", "业州镇", "珠山镇"]
    }, {
        "name": "黄冈市",
        "districtAndCounty": ["漕河镇", "城关镇", "凤山镇", "红安县", "黄梅县", "黄梅镇", "黄州区", "罗田县", "麻城市", "蕲春县", "清泉镇", "团风县", "团风镇", "温泉镇", "武穴市", "浠水县", "英山县"]
    }, {
        "name": "黄石市",
        "districtAndCounty": ["大冶市", "黄石港区", "铁山区", "西塞山区", "下陆区", "兴国镇", "阳新县"]
    }, {
        "name": "荆门市",
        "districtAndCounty": ["东宝区", "掇刀区", "京山县", "沙洋县", "沙洋镇", "新市镇", "钟祥市"]
    }, {
        "name": "荆州市",
        "districtAndCounty": ["斗湖堤镇", "公安县", "郝穴镇", "洪湖市", "监利县", "江陵县", "荆州区", "容城镇", "沙市区", "石首市", "松滋市"]
    }, {
        "name": "省直辖县级行政单位",
        "districtAndCounty": ["潜江市", "神农架林区", "松柏镇", "天门市", "仙桃市"]
    }, {
        "name": "十堰市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "丹江口市", "房县", "茅箭区", "郧西县", "郧县", "张湾区", "竹山县", "竹溪县"]
    }, {
        "name": "随州市",
        "districtAndCounty": ["曾都区", "广水市"]
    }, {
        "name": "武汉市",
        "districtAndCounty": ["蔡甸区", "东西湖区", "汉南区", "汉阳区", "洪山区", "黄陂区", "江岸区", "江汉区", "江夏区", "硚口区", "青山区", "武昌区", "新洲区"]
    }, {
        "name": "咸宁市",
        "districtAndCounty": ["赤壁市", "崇阳县", "嘉鱼县", "隽水镇", "天城镇", "通城县", "通山县", "通羊镇", "咸安区", "鱼岳镇"]
    }, {
        "name": "襄樊市",
        "districtAndCounty": ["保康县", "城关镇", "城关镇", "城关镇", "樊城区", "谷城县", "老河口市", "南漳县", "襄城区", "襄阳区", "宜城市", "枣阳市"]
    }, {
        "name": "孝感市",
        "districtAndCounty": ["安陆市", "城关镇", "城关镇", "大悟县", "汉川市", "花园镇", "孝昌县", "孝南区", "应城市", "云梦县"]
    }, {
        "name": "宜昌市",
        "districtAndCounty": ["当阳市", "点军区", "古夫镇", "龙舟坪镇", "茅坪镇", "鸣凤镇", "五峰土家族自治县", "五峰镇", "伍家岗区", "西陵区", "猇亭区", "兴山县", "夷陵区", "宜都市", "远安县", "长阳土家族自治县", "枝江市", "秭归县"]
    }]
}, {
    "name": "湖南省",
    "city": [{
        "name": "常德市",
        "districtAndCounty": ["安福镇", "安乡县", "城关镇", "楚江镇", "鼎城区", "汉寿县", "津市市", "澧县", "澧阳镇", "临澧县", "龙阳镇", "石门县", "桃源县", "武陵区", "漳江镇"]
    }, {
        "name": "郴州市",
        "districtAndCounty": ["安仁县", "北湖区", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "桂东县", "桂阳县", "嘉禾县", "临武县", "汝城县", "苏仙区", "宜章县", "永兴县", "资兴市"]
    }, {
        "name": "衡阳市",
        "districtAndCounty": ["常宁市", "城关镇", "衡东县", "衡南县", "衡山县", "衡阳县", "洪桥镇", "开云镇", "耒阳市", "南岳区", "祁东县", "石鼓区", "西渡镇", "雁峰区", "云集镇", "蒸湘区", "珠晖区"]
    }, {
        "name": "怀化市",
        "districtAndCounty": ["辰溪县", "辰阳镇", "高村镇", "鹤城区", "洪江市", "会同县", "靖州苗族侗族自治县", "林城镇", "卢峰镇", "麻阳苗族自治县", "渠阳镇", "双江镇", "通道侗族自治县", "新晃侗族自治县", "新晃镇", "溆浦县", "沅陵县", "沅陵镇", "芷江侗族自治县", "芷江镇", "中方县", "中方镇"]
    }, {
        "name": "娄底市",
        "districtAndCounty": ["冷水江市", "涟源市", "娄星区", "上梅镇", "双峰县", "新化县", "永丰镇"]
    }, {
        "name": "邵阳市",
        "districtAndCounty": ["北塔区", "城步苗族自治县", "大祥区", "洞口县", "洞口镇", "金石镇", "两市镇", "隆回县", "酿溪镇", "儒林镇", "邵东县", "邵阳县", "双清区", "绥宁县", "塘渡口镇", "桃洪镇", "武冈市", "新宁县", "新邵县", "长铺镇"]
    }, {
        "name": "湘潭市",
        "districtAndCounty": ["韶山市", "湘潭县", "湘乡市", "易俗河镇", "雨湖区", "岳塘区"]
    }, {
        "name": "湘西州",
        "districtAndCounty": ["白沙镇", "保靖县", "凤凰县", "古阳镇", "古丈县", "花垣县", "花垣镇", "吉首市", "灵溪镇", "龙山县", "泸溪县", "迁陵镇", "沱江镇", "永顺县"]
    }, {
        "name": "益阳市",
        "districtAndCounty": ["安化县", "东坪镇", "赫山区", "南县", "南洲镇", "桃花江镇", "桃江县", "沅江市", "资阳区"]
    }, {
        "name": "永州市",
        "districtAndCounty": ["白牙市镇", "道江镇", "道县", "东安县", "江华瑶族自治县", "江永县", "蓝山县", "冷水滩区", "零陵区", "龙泉镇", "泷泊镇", "宁远县", "祁阳县", "双牌县", "舜陵镇", "塔峰镇", "沱江镇", "浯溪镇", "潇浦镇", "新田县"]
    }, {
        "name": "岳阳市",
        "districtAndCounty": ["城关镇", "汉昌镇", "华容县", "君山区", "临湘市", "汨罗市", "平江县", "荣家湾镇", "文星镇", "湘阴县", "岳阳楼区", "岳阳县", "云溪区"]
    }, {
        "name": "张家界市",
        "districtAndCounty": ["慈利县", "澧源镇", "零阳镇", "桑植县", "武陵源区", "永定区"]
    }, {
        "name": "长沙市",
        "districtAndCounty": ["芙蓉区", "高塘岭镇", "开福区", "浏阳市", "宁乡县", "天心区", "望城县", "星沙镇", "雨花区", "玉潭镇", "岳麓区", "长沙市", "长沙县"]
    }, {
        "name": "株洲市",
        "districtAndCounty": ["茶陵县", "城关镇", "城关镇", "荷塘区", "醴陵市", "芦淞区", "渌口镇", "石峰区", "天元区", "霞阳镇", "炎陵县", "攸县", "株洲县"]
    }]
}, {
    "name": "吉林省",
    "city": [{
        "name": "白城市",
        "districtAndCounty": ["大安市", "开通镇", "洮北区", "洮南市", "通榆县", "镇赉县", "镇赉镇"]
    }, {
        "name": "白山市",
        "districtAndCounty": ["八道江区", "抚松县", "抚松镇", "江源县", "靖宇县", "靖宇镇", "临江市", "孙家堡子镇", "长白朝鲜族自治县", "长白镇"]
    }, {
        "name": "吉林市",
        "districtAndCounty": ["昌邑区", "船营区", "丰满区", "桦甸市", "蛟河市", "口前镇", "龙潭区", "磐石市", "舒兰市", "永吉县"]
    }, {
        "name": "辽源市",
        "districtAndCounty": ["白泉镇", "东丰县", "东丰镇", "东辽县", "龙山区", "西安区"]
    }, {
        "name": "四平市",
        "districtAndCounty": ["公主岭市", "梨树县", "梨树镇", "双辽市", "铁东区", "铁西区", "伊通满族自治县", "伊通镇"]
    }, {
        "name": "松原市",
        "districtAndCounty": ["扶余县", "乾安县", "乾安镇", "宁江区", "前郭尔罗斯蒙古族自治县", "前郭镇", "三岔河镇", "长岭县", "长岭镇"]
    }, {
        "name": "通化市",
        "districtAndCounty": ["朝阳镇", "东昌区", "二道江区", "辉南县", "集安市", "快大茂镇", "柳河县", "柳河镇", "梅河口市", "通化县"]
    }, {
        "name": "延边州",
        "districtAndCounty": ["安图县", "敦化市", "和龙市", "珲春市", "龙井市", "明月镇", "图们市", "汪清县", "汪清镇", "延吉市"]
    }, {
        "name": "长春市",
        "districtAndCounty": ["朝阳区", "德惠市", "二道区", "九台市", "宽城区", "绿园区", "南关区", "农安县", "农安镇", "双阳区", "榆树市"]
    }]
}, {
    "name": "江苏省",
    "city": [{
        "name": "常州市",
        "districtAndCounty": ["金坛市", "溧阳市", "戚墅堰区", "天宁区", "武进区", "新北区", "钟楼区"]
    }, {
        "name": "淮安市",
        "districtAndCounty": ["楚州区", "高良涧镇", "洪泽县", "淮阴区", "金湖县", "黎城镇", "涟城镇", "涟水县", "清河区", "清浦区", "盱城镇", "盱眙县"]
    }, {
        "name": "连云港市",
        "districtAndCounty": ["东海县", "赣榆县", "灌南县", "灌云县", "海州区", "连云区", "牛山镇", "青口镇", "新安镇", "新浦区", "伊山镇"]
    }, {
        "name": "南京市",
        "districtAndCounty": ["白下区", "淳溪镇", "高淳县", "鼓楼区", "建邺区", "江宁区", "溧水县", "六合区", "浦口区", "栖霞区", "秦淮区", "下关区", "玄武区", "永阳镇", "雨花台区"]
    }, {
        "name": "南通市",
        "districtAndCounty": ["崇川区", "港闸区", "海安县", "海安镇", "海门市", "掘港镇", "启东市", "如东县", "如皋市", "通州市"]
    }, {
        "name": "苏州市",
        "districtAndCounty": ["沧浪区", "常熟市", "虎丘区", "金阊区", "昆山市", "平江区", "太仓市", "吴江市", "吴中区", "相城区", "张家港市"]
    }, {
        "name": "宿迁市",
        "districtAndCounty": ["青阳镇", "沭城镇", "沭阳县", "泗洪县", "泗阳县", "宿城区", "宿豫区", "众兴镇"]
    }, {
        "name": "泰州市",
        "districtAndCounty": ["高港区", "海陵区", "姜堰市", "靖江市", "泰兴市", "兴化市"]
    }, {
        "name": "无锡市",
        "districtAndCounty": ["北塘区", "滨湖区", "崇安区", "惠山区", "江阴市", "南长区", "锡山区", "宜兴市"]
    }, {
        "name": "徐州市",
        "districtAndCounty": ["丰县", "凤城镇", "鼓楼区", "贾汪区", "九里区", "沛城镇", "沛县", "邳州市", "泉山区", "睢城镇", "睢宁县", "铜山县", "铜山镇", "新沂市", "云龙区"]
    }, {
        "name": "盐城市",
        "districtAndCounty": ["滨海县", "大丰市", "东坎镇", "东台市", "阜城镇", "阜宁县", "合德镇", "建湖县", "近湖镇", "射阳县", "亭湖区", "响水县", "响水镇", "盐都区"]
    }, {
        "name": "扬州市",
        "districtAndCounty": ["安宜镇", "宝应县", "高邮市", "广陵区", "邗江区", "江都市", "维扬区", "仪征市"]
    }, {
        "name": "镇江市",
        "districtAndCounty": ["丹徒区", "丹阳市", "京口区", "句容市", "润州区", "扬中市"]
    }]
}, {
    "name": "江西省",
    "city": [{
        "name": "抚州市",
        "districtAndCounty": ["鳌溪镇", "巴山镇", "崇仁县", "东乡县", "凤冈镇", "广昌县", "鹤城镇", "建昌镇", "金溪县", "乐安县", "黎川县", "临川区", "南城县", "南丰县", "琴城镇", "日峰镇", "孝岗镇", "秀谷镇", "旴江镇", "宜黄县", "资溪县"]
    }, {
        "name": "赣州市",
        "districtAndCounty": ["安远县", "城厢镇", "崇义县", "大余县", "定南县", "东山镇", "赣县", "贡江镇", "横水镇", "会昌县", "嘉定镇", "历市镇", "潋江镇", "龙南县", "龙南镇", "梅江镇", "梅林镇", "南安镇", "南康市", "宁都县", "琴江镇", "全南县", "瑞金市", "上犹县", "石城县", "文武坝镇", "欣山镇", "信丰县", "兴国县", "寻乌县", "于都县", "章贡区", "长宁镇"]
    }, {
        "name": "吉安市",
        "districtAndCounty": ["安福县", "澄江镇", "敦厚镇", "恩江镇", "芙蓉镇", "禾川镇", "吉安县", "吉水县", "吉州区", "金川镇", "井冈山市", "平都镇", "青原区", "泉江镇", "厦坪镇", "水边镇", "遂川县", "泰和县", "万安县", "文峰镇", "峡江县", "新干县", "永丰县", "永新县"]
    }, {
        "name": "景德镇市",
        "districtAndCounty": ["昌江区", "浮梁县", "浮梁镇", "乐平市", "珠山区"]
    }, {
        "name": "九江市",
        "districtAndCounty": ["德安县", "都昌县", "都昌镇", "湖口县", "九江县", "龙城镇", "庐山区", "南康镇", "彭泽县", "蒲亭镇", "瑞昌市", "沙河街镇", "双钟镇", "涂埠镇", "武宁县", "新宁镇", "星子县", "修水县", "浔阳区", "义宁镇", "永修县"]
    }, {
        "name": "南昌市",
        "districtAndCounty": ["安义县", "东湖区", "进贤县", "莲塘镇", "龙津镇", "民和镇", "南昌县", "青山湖区", "青云谱区", "湾里区", "西湖区", "新建县", "长堎镇"]
    }, {
        "name": "萍乡市",
        "districtAndCounty": ["安源区", "莲花县", "芦溪县", "芦溪镇", "琴亭镇", "上栗县", "上栗镇", "湘东区"]
    }, {
        "name": "上饶市",
        "districtAndCounty": ["冰溪镇", "岑阳镇", "陈营镇", "德兴市", "广丰县", "河口镇", "横峰县", "鄱阳县", "鄱阳镇", "铅山县", "上饶县", "万年县", "婺源县", "信州区", "旭日镇", "弋江镇", "弋阳县", "永丰镇", "余干县", "玉山县", "玉亭镇", "紫阳镇"]
    }, {
        "name": "新余市",
        "districtAndCounty": ["分宜县", "分宜镇", "渝水区"]
    }, {
        "name": "宜春市",
        "districtAndCounty": ["丰城市", "冯川镇", "奉新县", "高安市", "靖安县", "上高县", "双溪镇", "铜鼓县", "万载县", "新昌镇", "宜丰县", "永宁镇", "袁州区", "樟树市"]
    }, {
        "name": "鹰潭市",
        "districtAndCounty": ["邓埠镇", "贵溪市", "余江县", "月湖区"]
    }]
}, {
    "name": "辽宁省",
    "city": [{
        "name": "鞍山市",
        "districtAndCounty": ["海城市", "立山区", "千山区", "台安县", "台安镇", "铁东区", "铁西区", "岫岩满族自治县", "岫岩镇"]
    }, {
        "name": "本溪市",
        "districtAndCounty": ["本溪满族自治县", "桓仁满族自治县", "桓仁镇", "明山区", "南芬区", "平山区", "溪湖区", "小市镇"]
    }, {
        "name": "朝阳市",
        "districtAndCounty": ["北票市", "朝阳市双塔区", "朝阳县", "大城子镇", "建平县", "喀喇沁左翼蒙古族自治县", "凌源市", "龙城区", "双塔区"]
    }, {
        "name": "大连市",
        "districtAndCounty": ["大长山岛镇", "甘井子区", "金州区", "旅顺口区", "普兰店市", "沙河口区", "瓦房店市", "西岗区", "长海县", "中山区", "庄河市"]
    }, {
        "name": "丹东市",
        "districtAndCounty": ["东港市", "凤城市", "宽甸满族自治县", "宽甸镇", "元宝区", "振安区", "振兴区"]
    }, {
        "name": "抚顺市",
        "districtAndCounty": ["东洲区", "抚顺市顺城区", "抚顺县", "清原满族自治县", "清原镇", "顺城区", "望花区", "新宾满族自治县", "新宾镇", "新抚区"]
    }, {
        "name": "阜新市",
        "districtAndCounty": ["阜新蒙古族自治县", "阜新镇", "海州区", "清河门区", "太平区", "细河区", "新邱区", "彰武县", "彰武镇"]
    }, {
        "name": "葫芦岛市",
        "districtAndCounty": ["建昌县", "建昌镇", "连山区", "龙港区", "南票区", "绥中县", "绥中镇", "兴城市"]
    }, {
        "name": "锦州市",
        "districtAndCounty": ["北宁市", "古塔区", "黑山县", "黑山镇", "凌海市", "凌河区", "太和区", "义县", "义州镇"]
    }, {
        "name": "辽阳市",
        "districtAndCounty": ["白塔区", "灯塔市", "弓长岭区", "宏伟区", "辽阳县", "首山镇", "太子河区", "文圣区"]
    }, {
        "name": "盘锦市",
        "districtAndCounty": ["大洼县", "大洼镇", "盘锦市双台子区", "盘山县", "双台子区", "兴隆台区"]
    }, {
        "name": "沈阳市",
        "districtAndCounty": ["沈河区", "大东区", "东陵区", "法库县", "法库镇", "和平区", "皇姑区", "康平县", "康平镇", "辽中县", "辽中镇", "苏家屯区", "铁西区", "新城子区", "新民市", "于洪区"]
    }, {
        "name": "铁岭市",
        "districtAndCounty": ["昌图县", "昌图镇", "调兵山市", "开原市", "清河区", "铁岭市银州区", "铁岭县", "西丰县", "西丰镇", "银州区"]
    }, {
        "name": "营口市",
        "districtAndCounty": ["鲅鱼圈区", "大石桥市", "盖州市", "老边区", "西市区", "站前区"]
    }]
}, {
    "name": "内蒙古",
    "city": [{
        "name": "阿拉善盟",
        "districtAndCounty": ["阿拉善右旗", "巴彦浩特镇", "达来呼布镇", "额济纳旗", "额肯呼都格镇"]
    }, {
        "name": "巴彦淖尔市",
        "districtAndCounty": ["巴彦高勒镇", "巴音宝力格镇", "磴口县", "海流图镇", "杭锦后旗", "临河区", "隆兴昌镇", "陕坝镇", "乌拉山镇", "乌拉特后旗", "乌拉特前旗", "乌拉特中旗", "五原县"]
    }, {
        "name": "包头市",
        "districtAndCounty": ["白云矿区", "百灵庙镇", "达尔罕茂明安联合旗", "东河区", "固阳县", "金山镇", "九原区", "昆都仑区", "青山区", "萨拉齐镇", "石拐区", "土默特右旗"]
    }, {
        "name": "赤峰市",
        "districtAndCounty": ["阿鲁科尔沁旗", "敖汉旗", "巴林右旗", "巴林左旗", "大板镇", "红山区", "锦山镇", "经棚镇", "喀喇沁旗", "克什克腾旗", "林东镇", "林西县", "林西镇", "宁城县", "松山区", "天山镇", "天义镇", "翁牛特旗", "乌丹镇", "新惠镇", "元宝山区"]
    }, {
        "name": "鄂尔多斯市",
        "districtAndCounty": ["阿勒腾席热镇", "敖勒召其镇", "达拉特旗", "东胜区", "鄂托克旗", "鄂托克前旗", "嘎鲁图镇", "杭锦旗", "树林召镇", "乌兰镇", "乌审旗", "锡尼镇", "薛家湾镇", "伊金霍洛旗", "准格尔旗"]
    }, {
        "name": "呼和浩特市",
        "districtAndCounty": ["察素齐镇", "城关镇", "城关镇", "和林格尔县", "回民区", "可可以力更镇", "清水河县", "赛罕区", "双河镇", "土默特左旗", "托克托县", "武川县", "新城区", "玉泉区"]
    }, {
        "name": "呼伦贝尔市",
        "districtAndCounty": ["阿拉坦额莫勒镇", "阿里河镇", "阿穆古郎镇", "阿荣旗", "巴彦库仁镇", "巴彦托海镇", "陈巴尔虎旗", "额尔古纳市", "鄂伦春自治旗", "鄂温克族自治旗", "根河市", "海拉尔区", "满洲里市", "莫力达瓦达斡尔族自治旗", "那吉镇", "尼尔基镇", "新巴尔虎右旗", "新巴尔虎左旗", "牙克石市", "扎兰屯市"]
    }, {
        "name": "通辽市",
        "districtAndCounty": ["保康镇", "大沁他拉镇", "甘旗卡镇", "霍林郭勒市", "开鲁县", "开鲁镇", "科尔沁区", "科尔沁左翼后旗", "科尔沁左翼中旗", "库伦旗", "库伦镇", "鲁北镇", "奈曼旗", "扎鲁特旗"]
    }, {
        "name": "乌海市",
        "districtAndCounty": ["海勃湾区", "海南区", "乌达区"]
    }, {
        "name": "乌兰察布市",
        "districtAndCounty": ["白音察干镇", "察哈尔右翼后旗", "察哈尔右翼前旗", "察哈尔右翼中旗", "城关镇", "岱海镇", "丰镇市", "化德县", "集宁区", "科布尔镇", "凉城县", "商都县", "商都镇", "四子王旗", "土贵乌拉镇", "乌兰花镇", "兴和县", "长顺镇", "卓资山镇", "卓资县"]
    }, {
        "name": "锡林郭勒盟",
        "districtAndCounty": ["阿巴嘎旗", "巴拉嘎尔郭勒镇", "宝昌镇", "别力古台镇", "东乌珠穆沁旗", "多伦淖尔镇", "多伦县", "二连浩特市", "满都拉图镇", "明安图镇", "赛汉塔拉镇", "上都镇", "苏尼特右旗", "苏尼特左旗", "太仆寺旗", "乌里雅斯太镇", "西乌珠穆沁旗", "锡林浩特市", "镶黄旗", "新宝拉格镇", "正蓝旗", "正镶白旗"]
    }, {
        "name": "兴安盟",
        "districtAndCounty": ["阿尔山市", "巴彦呼硕镇", "大坝沟镇", "科尔沁右翼前旗", "科尔沁右翼中旗", "突泉县", "突泉镇", "乌兰浩特市", "音德尔镇", "扎赉特旗"]
    }]
}, {
    "name": "宁夏",
    "city": [{
        "name": "固原市",
        "districtAndCounty": ["白阳镇", "城关镇", "吉强镇", "泾源县", "隆德县", "彭阳县", "西吉县", "香水镇", "原州区"]
    }, {
        "name": "石嘴山市",
        "districtAndCounty": ["城关镇", "大武口区", "惠农区", "平罗县"]
    }, {
        "name": "吴忠市",
        "districtAndCounty": ["花马池镇", "利通区", "青铜峡市", "同心县", "盐池县", "豫海镇"]
    }, {
        "name": "银川市",
        "districtAndCounty": ["贺兰县", "金凤区", "灵武市", "西夏区", "习岗镇", "兴庆区", "杨和镇", "永宁县"]
    }, {
        "name": "中卫市",
        "districtAndCounty": ["海原县", "沙坡头区", "中宁县"]
    }]
}, {
    "name": "青海省",
    "city": [{
        "name": "果洛州",
        "districtAndCounty": ["班玛县", "达日县", "大武镇", "甘德县", "黄河乡", "吉迈镇", "久治县", "柯曲镇", "玛多县", "玛沁县", "赛来塘镇", "智青松多镇"]
    }, {
        "name": "海北州",
        "districtAndCounty": ["八宝镇", "刚察县", "海晏县", "浩门镇", "门源回族自治县", "祁连县", "三角城镇", "沙柳河镇"]
    }, {
        "name": "海东地区",
        "districtAndCounty": ["巴燕镇", "川口镇", "互助土族自治县", "化隆回族自治县", "积石镇", "乐都县", "民和回族土族自治县", "碾伯镇", "平安县", "平安镇", "威远镇", "循化撒拉族自治县"]
    }, {
        "name": "海南州",
        "districtAndCounty": ["尕巴松多镇", "共和县", "贵德县", "贵南县", "河阴镇", "茫曲镇", "恰卜恰镇", "同德县", "兴海县", "子科滩镇"]
    }, {
        "name": "海西州",
        "districtAndCounty": ["察汗乌苏镇", "德令哈市", "都兰县", "格尔木市", "天峻县", "乌兰县", "希里沟镇", "新源镇"]
    }, {
        "name": "黄南州",
        "districtAndCounty": ["河南蒙古族自治县", "尖扎县", "隆务镇", "马克唐镇", "同仁县", "优干宁镇", "泽库县", "泽曲镇"]
    }, {
        "name": "西宁市",
        "districtAndCounty": ["城北区", "城东区", "城关镇", "城西区", "城中区", "大通回族土族自治县", "湟源县", "湟中县", "鲁沙尔镇", "桥头镇"]
    }, {
        "name": "玉树州",
        "districtAndCounty": ["称多县", "称文镇", "加吉博洛镇", "结古镇", "囊谦县", "曲麻莱县", "萨呼腾镇", "香达镇", "玉树县", "约改镇", "杂多县", "治多县"]
    }]
}, {
    "name": "山东省",
    "city": [{
        "name": "滨州市",
        "districtAndCounty": ["滨城区", "博兴县", "博兴镇", "富国镇", "惠民县", "惠民镇", "无棣县", "无棣镇", "阳信县", "阳信镇", "沾化县", "邹平县"]
    }, {
        "name": "德州市",
        "districtAndCounty": ["德城区", "乐陵市", "临邑县", "陵城镇", "陵县", "宁津县", "宁津镇", "平原县", "齐河县", "庆云县", "庆云镇", "武城县", "武城镇", "夏津县", "夏津镇", "晏城镇", "禹城市"]
    }, {
        "name": "东营市",
        "districtAndCounty": ["东营区", "广饶县", "广饶镇", "河口区", "垦利县", "垦利镇", "利津县", "利津镇"]
    }, {
        "name": "菏泽市",
        "districtAndCounty": ["曹城镇", "曹县", "成武县", "成武镇", "城关镇", "单城镇", "单县", "定陶县", "定陶镇", "东明县", "巨野县", "巨野镇", "鄄城县", "鄄城镇", "牡丹区", "郓城县", "郓城镇"]
    }, {
        "name": "济南市",
        "districtAndCounty": ["槐荫区", "济阳县", "济阳镇", "历城区", "历下区", "平阴县", "平阴镇", "商河县", "市中区", "天桥区", "章丘市", "长清区"]
    }, {
        "name": "济宁市",
        "districtAndCounty": ["谷亭镇", "嘉祥县", "嘉祥镇", "金乡县", "金乡镇", "梁山县", "梁山镇", "曲阜市", "任城区", "市中区", "泗水县", "微山县", "汶上县", "汶上镇", "兖州市", "鱼台县", "邹城市"]
    }, {
        "name": "莱芜市",
        "districtAndCounty": ["钢城区", "莱城区"]
    }, {
        "name": "聊城市",
        "districtAndCounty": ["茌平县", "东阿县", "东昌府区", "高唐县", "冠城镇", "冠县", "临清市", "莘县", "阳谷县"]
    }, {
        "name": "临沂市",
        "districtAndCounty": ["卞庄镇", "苍山县", "费城镇", "费县", "河东区", "界湖镇", "莒南县", "兰山区", "临沭县", "临沭镇", "罗庄区", "蒙阴县", "蒙阴镇", "平邑县", "平邑镇", "十字路镇", "郯城县", "郯城镇", "沂南县", "沂水县", "沂水镇"]
    }, {
        "name": "青岛市",
        "districtAndCounty": ["城阳区", "黄岛区", "即墨市", "胶南市", "胶州市", "莱西市", "崂山区", "李沧区", "平度市", "市北区", "市南区", "四方区"]
    }, {
        "name": "日照市",
        "districtAndCounty": ["城阳镇", "东港区", "洪凝镇", "莒县", "岚山区", "五莲县"]
    }, {
        "name": "泰安市",
        "districtAndCounty": ["岱岳区", "东平县", "东平镇", "肥城市", "宁阳县", "宁阳镇", "泰山区", "新泰市"]
    }, {
        "name": "威海市",
        "districtAndCounty": ["环翠区", "荣成市", "乳山市", "文登市"]
    }, {
        "name": "潍坊市",
        "districtAndCounty": ["安丘市", "昌乐县", "昌邑市", "坊子区", "高密市", "寒亭区", "奎文区", "临朐县", "青州市", "寿光市", "潍城区", "诸城市"]
    }, {
        "name": "烟台市",
        "districtAndCounty": ["福山区", "海阳市", "莱山区", "莱阳市", "莱州市", "龙口市", "牟平区", "南长山镇", "蓬莱市", "栖霞市", "长岛县", "招远市", "芝罘区"]
    }, {
        "name": "枣庄市",
        "districtAndCounty": ["山亭区", "市中区", "台儿庄区", "滕州市", "薛城区", "峄城区"]
    }, {
        "name": "淄博市",
        "districtAndCounty": ["博山区", "高青县", "桓台县", "临淄区", "南麻镇", "索镇", "田镇", "沂源县", "张店区", "周村区", "淄川区"]
    }]
}, {
    "name": "山西省",
    "city": [{
        "name": "大同市",
        "districtAndCounty": ["城区", "大同县", "广灵县", "壶泉镇", "浑源县", "矿区", "灵丘县", "龙泉镇", "南郊区", "天镇县", "武灵镇", "西坪镇", "新荣区", "阳高县", "永安镇", "玉泉镇", "云兴镇", "左云县"]
    }, {
        "name": "晋城市",
        "districtAndCounty": ["城区", "崇文镇", "凤城镇", "高平市", "陵川县", "龙港镇", "南村镇", "沁水县", "阳城县", "泽州县"]
    }, {
        "name": "晋中市",
        "districtAndCounty": ["朝阳镇", "翠峰镇", "古陶镇", "和顺县", "箕城镇", "介休市", "乐平镇", "辽阳镇", "灵石县", "明星镇", "平遥县", "祁县", "寿阳县", "太谷县", "昔阳县", "义兴镇", "榆次区", "榆社县", "昭余镇", "左权县"]
    }, {
        "name": "临汾市",
        "districtAndCounty": ["安泽县", "昌宁镇", "大槐树镇", "大宁县", "汾西县", "浮山县", "府城镇", "古县", "洪洞县", "侯马市", "霍州市", "吉昌镇", "吉县", "乐昌镇", "龙泉镇", "蒲城镇", "蒲县", "曲沃县", "唐兴镇", "天坛镇", "隰县", "乡宁县", "襄汾县", "昕水镇", "新城镇", "尧都区", "翼城县", "永安镇", "永和县", "岳阳镇", "芝河镇"]
    }, {
        "name": "吕梁市",
        "districtAndCounty": ["东村镇", "方山县", "汾阳市", "凤城镇", "圪洞镇", "交城县", "交口县", "岚县", "离石区", "临泉镇", "临县", "灵泉镇", "柳林县", "柳林镇", "宁乡镇", "石楼县", "水头镇", "天宁镇", "蔚汾镇", "文水县", "孝义市", "兴县", "中阳县"]
    }, {
        "name": "朔州市",
        "districtAndCounty": ["岱岳乡", "怀仁县", "金城镇", "平鲁区", "山阴县", "朔城区", "新城镇", "应县", "右玉县", "云中镇"]
    }, {
        "name": "太原市",
        "districtAndCounty": ["古交市", "黄寨镇", "尖草坪区", "晋源区", "娄烦县", "娄烦镇", "清徐县", "清源镇", "万柏林区", "小店区", "杏花岭区", "阳曲县", "迎泽区"]
    }, {
        "name": "忻州市",
        "districtAndCounty": ["保德县", "代县", "定襄县", "东关镇", "鹅城镇", "繁城镇", "繁峙县", "凤凰镇", "河曲县", "晋昌镇", "静乐县", "岢岚县", "岚漪镇", "龙泉镇", "宁武县", "偏关县", "上馆镇", "神池县", "台城镇", "文笔镇", "五台县", "五寨县", "忻府区", "新关镇", "砚城镇", "原平市"]
    }, {
        "name": "阳泉市",
        "districtAndCounty": ["城区", "冠山镇", "郊区", "矿区", "平定县", "秀水镇", "盂县"]
    }, {
        "name": "运城市",
        "districtAndCounty": ["古绛镇", "古魏镇", "河津市", "稷峰镇", "稷山县", "绛县", "解店镇", "临猗县", "龙兴镇", "平陆县", "芮城县", "圣人涧镇", "桐城镇", "万荣县", "闻喜县", "夏县", "新城镇", "新绛县", "盐湖区", "瑶峰镇", "猗氏镇", "永济市", "垣曲县"]
    }, {
        "name": "长治市",
        "districtAndCounty": ["城区", "丹朱镇", "定昌镇", "丰州镇", "古韩镇", "韩店镇", "壶关县", "郊区", "黎城县", "黎侯镇", "麟绛镇", "龙泉镇", "潞城市", "平顺县", "沁河镇", "沁县", "沁源县", "青羊镇", "屯留县", "武乡县", "襄垣县", "长治县", "长子县"]
    }]
}, {
    "name": "陕西省",
    "city": [{
        "name": "安康市",
        "districtAndCounty": ["白河县", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "汉滨区", "汉阴县", "岚皋县", "宁陕县", "平利县", "石泉县", "旬阳县", "镇坪县", "紫阳县"]
    }, {
        "name": "宝鸡市",
        "districtAndCounty": ["陈仓区", "城关镇", "城关镇", "城关镇", "城关镇", "凤鸣镇", "凤县", "凤翔县", "扶风县", "金台区", "九成宫镇", "麟游县", "陇县", "眉县", "岐山县", "千阳县", "首善镇", "双石铺镇", "太白县", "渭滨区", "嘴头镇"]
    }, {
        "name": "汉中市",
        "districtAndCounty": ["博望镇", "城固县", "城关镇", "城关镇", "城关镇", "城关镇", "佛坪县", "汉台区", "汉源镇", "泾洋镇", "留坝县", "略阳县", "勉县", "勉阳镇", "南郑县", "宁强县", "西乡县", "洋县", "洋州镇", "袁家庄镇", "镇巴县"]
    }, {
        "name": "商洛市",
        "districtAndCounty": ["城关镇", "城关镇", "城关镇", "丹凤县", "乾佑镇", "龙驹寨镇", "洛南县", "山阳县", "商南县", "商州区", "永乐镇", "柞水县", "镇安县"]
    }, {
        "name": "铜川市",
        "districtAndCounty": ["城关镇", "王益区", "耀州区", "宜君县", "印台区"]
    }, {
        "name": "渭南市",
        "districtAndCounty": ["白水县", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "澄城县", "大荔县", "窦村镇", "富平县", "韩城市", "合阳县", "华县", "华阴市", "华州镇", "临渭区", "蒲城县", "潼关县"]
    }, {
        "name": "西安市",
        "districtAndCounty": ["灞桥区", "碑林区", "二曲镇", "甘亭镇", "高陵县", "户县", "蓝关镇", "蓝田县", "莲湖区", "临潼区", "鹿苑镇", "未央区", "新城区", "阎良区", "雁塔区", "长安区", "周至县"]
    }, {
        "name": "咸阳市",
        "districtAndCounty": ["彬县", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "城关镇", "淳化县", "乾县", "监军镇", "泾干镇", "泾阳县", "礼泉县", "普集镇", "秦都区", "三原县", "渭城区", "武功县", "兴平市", "旬邑县", "杨陵区", "永寿县", "长武县", "昭仁镇"]
    }, {
        "name": "延安市",
        "districtAndCounty": ["安塞县", "宝塔区", "保安镇", "城关镇", "丹州镇", "凤栖镇", "富城镇", "富县", "甘泉县", "黄陵县", "黄龙县", "洛川县", "七里村镇", "桥山镇", "石堡镇", "瓦窑堡镇", "吴旗镇", "吴起县", "延川县", "延川镇", "延长县", "宜川县", "真武洞镇", "志丹县", "子长县"]
    }, {
        "name": "榆林市",
        "districtAndCounty": ["定边县", "定边镇", "府谷县", "府谷镇", "横山县", "横山镇", "佳芦镇", "佳县", "靖边县", "宽洲镇", "米脂县", "名州镇", "清涧县", "神木县", "神木镇", "双湖峪镇", "宋家川镇", "绥德县", "吴堡县", "银州镇", "榆阳区", "张家畔镇", "子洲县"]
    }]
}, {
    "name": "上海市",
    "city": [{
        "name": "上海市",
        "districtAndCounty": ["宝山区?", "城桥镇", "崇明县", "奉贤区", "虹口区", "黄浦区", "嘉定区", "金山区", "静安区", "卢湾区", "闵行区", "南汇区", "浦东新区", "普陀区", "青浦区", "松江区", "徐汇区", "杨浦区", "闸北区", "长宁区"]
    }]
}, {
    "name": "四川省",
    "city": [{
        "name": "阿坝州",
        "districtAndCounty": ["阿坝县", "阿坝镇", "达扎寺镇", "凤仪镇", "黑水县", "红原县", "金川县", "金川镇", "进安镇", "九寨沟县", "理县", "芦花镇", "马尔康县", "马尔康镇", "茂县", "美兴镇", "邛溪镇", "壤柯镇", "壤塘县", "若尔盖县", "松潘县", "威州镇", "汶川县", "小金县", "永乐镇", "杂谷脑镇"]
    }, {
        "name": "巴中市",
        "districtAndCounty": ["巴州区", "江口镇", "南江县", "南江镇", "诺江镇", "平昌县", "通江县"]
    }, {
        "name": "成都市",
        "districtAndCounty": ["成华区", "崇州市", "大邑县", "都江堰市", "鹤山镇", "金牛区", "金堂县", "锦江区", "晋原镇", "龙泉驿区", "彭州市", "郫筒镇", "郫县", "蒲江县", "青白江区", "青羊区", "邛崃市", "双流县", "温江区", "五津镇", "武侯区", "新都区", "新津县", "赵镇"]
    }, {
        "name": "达州市",
        "districtAndCounty": ["达县", "大竹县", "东乡镇", "开江县", "南外镇", "渠江镇", "渠县", "通川区", "万源市", "新宁镇", "宣汉县", "竹阳镇"]
    }, {
        "name": "德阳市",
        "districtAndCounty": ["广汉市", "旌阳区", "凯江镇", "罗江县", "罗江镇", "绵竹市", "什邡市", "中江县"]
    }, {
        "name": "甘孜州",
        "districtAndCounty": ["巴塘县", "白玉县", "丹巴县", "道孚县", "稻城县", "得荣县", "德格县", "呷尔镇", "甘孜县", "甘孜镇", "高城镇", "更庆镇", "河口镇", "建设镇", "金珠镇", "九龙县", "康定县", "理塘县", "泸定县", "泸桥镇", "炉城镇", "炉霍县", "尼呷镇", "茹龙镇", "桑披镇", "色达县", "色柯镇", "石渠县", "松麦镇", "夏邛镇", "鲜水镇", "乡城县", "新都镇", "新龙县", "雅江县", "章谷镇"]
    }, {
        "name": "广安市",
        "districtAndCounty": ["鼎屏镇", "广安区", "华蓥市", "九龙镇", "邻水县", "武胜县", "沿口镇", "岳池县"]
    }, {
        "name": "广元市",
        "districtAndCounty": ["苍溪县", "朝天区", "东河镇", "剑阁县", "陵江镇", "乔庄镇", "青川县", "市中区", "旺苍县", "下寺镇", "元坝区"]
    }, {
        "name": "乐山市",
        "districtAndCounty": ["峨边彝族自治县", "峨眉山市", "夹江县", "犍为县", "金口河区", "井研县", "马边彝族自治县", "民建镇", "沐川县", "沐溪镇", "沙坪镇", "沙湾区", "市中区", "五通桥区", "漹城镇", "研城镇", "玉津镇"]
    }, {
        "name": "凉山州",
        "districtAndCounty": ["巴普镇", "布拖县", "城关镇", "城厢镇", "德昌县", "德州镇", "甘洛县", "光明镇", "会东县", "会东镇", "会理县", "金阳县", "锦城镇", "雷波县", "美姑县", "冕宁县", "木里藏族自治县", "宁南县", "披砂镇", "普格县", "普基镇", "乔瓦镇", "特木里镇", "天地坝镇", "西昌市", "喜德县", "新城镇", "新市坝镇", "盐井镇", "盐源县", "越城镇", "越西县", "昭觉县"]
    }, {
        "name": "泸州市",
        "districtAndCounty": ["福集镇", "古蔺县", "古蔺镇", "合江县", "合江镇", "江阳区", "龙马潭区", "泸县", "纳溪区", "叙永县", "叙永镇"]
    }, {
        "name": "眉山市",
        "districtAndCounty": ["城厢镇", "丹棱县", "丹棱镇", "东坡区", "凤鸣镇", "洪川镇", "洪雅县", "彭山县", "青神县", "仁寿县", "文林镇"]
    }, {
        "name": "绵阳市",
        "districtAndCounty": ["安县", "北川羌族自治县", "涪城区", "花荄镇", "江油市", "龙安镇", "平武县", "曲山镇", "三台县", "潼川镇", "文昌镇", "盐亭县", "游仙区", "云溪镇", "梓潼县"]
    }, {
        "name": "南充市",
        "districtAndCounty": ["高坪区", "嘉陵区", "晋城镇", "阆中市", "朗池镇", "南部县", "南隆镇", "蓬安县", "顺庆区", "西充县", "新政镇", "仪陇县", "营山县", "周口镇"]
    }, {
        "name": "内江市",
        "districtAndCounty": ["东兴区", "金鹅镇", "隆昌县", "市中区", "威远县", "严陵镇", "重龙镇", "资中县"]
    }, {
        "name": "攀枝花市",
        "districtAndCounty": ["东区", "米易县", "攀莲镇", "仁和区", "桐子林镇", "西区", "盐边县"]
    }, {
        "name": "遂宁市",
        "districtAndCounty": ["安居区", "赤城镇", "船山区", "大英县", "蓬莱镇", "蓬溪县", "射洪县", "太和镇"]
    }, {
        "name": "雅安市",
        "districtAndCounty": ["宝兴县", "城厢镇", "富林镇", "汉源县", "芦山县", "芦阳镇", "蒙阳镇", "名山县", "穆坪镇", "石棉县", "天全县", "新棉镇", "荥经县", "严道镇", "雨城区"]
    }, {
        "name": "宜宾市",
        "districtAndCounty": ["柏溪镇", "翠屏区", "高县", "珙县", "江安县", "江安镇", "南溪县", "南溪镇", "屏山县", "屏山镇", "庆符镇", "兴文县", "巡场镇", "宜宾县", "筠连县", "筠连镇", "长宁县", "长宁镇", "中城镇"]
    }, {
        "name": "资阳市",
        "districtAndCounty": ["安岳县", "简阳市", "乐至县", "天池镇", "雁江区", "岳阳镇"]
    }, {
        "name": "自贡市",
        "districtAndCounty": ["大安区", "富世镇", "富顺县", "贡井区", "荣县", "旭阳镇", "沿滩区", "自流井区"]
    }]
}, {
    "name": "台湾省",
    "city": [{
        "name": "高雄",
        "districtAndCounty": []
    }, {
        "name": "花莲",
        "districtAndCounty": []
    }, {
        "name": "基隆",
        "districtAndCounty": []
    }, {
        "name": "嘉义",
        "districtAndCounty": []
    }, {
        "name": "金门",
        "districtAndCounty": []
    }, {
        "name": "连江",
        "districtAndCounty": []
    }, {
        "name": "苗栗",
        "districtAndCounty": []
    }, {
        "name": "南投",
        "districtAndCounty": []
    }, {
        "name": "澎湖",
        "districtAndCounty": []
    }, {
        "name": "屏东",
        "districtAndCounty": []
    }, {
        "name": "台北",
        "districtAndCounty": []
    }, {
        "name": "台东",
        "districtAndCounty": []
    }, {
        "name": "台南",
        "districtAndCounty": []
    }, {
        "name": "台中",
        "districtAndCounty": []
    }, {
        "name": "桃园",
        "districtAndCounty": []
    }, {
        "name": "新竹",
        "districtAndCounty": []
    }, {
        "name": "宜兰",
        "districtAndCounty": []
    }, {
        "name": "云林",
        "districtAndCounty": []
    }, {
        "name": "彰化",
        "districtAndCounty": []
    }]
}, {
    "name": "天津市",
    "city": [{
        "name": "天津市",
        "districtAndCounty": ["宝坻区", "北辰区", "大港区", "东丽区", "汉沽区", "和平区", "河北区", "河东区", "河西区", "红桥区", "蓟县", "津南区", "静海县", "静海镇", "芦台镇", "南开区", "宁河县", "塘沽区", "武清区", "西青区"]
    }]
}, {
    "name": "西藏",
    "city": [{
        "name": "阿里地区",
        "districtAndCounty": ["措勤县", "措勤镇", "噶尔县", "改则县", "改则镇", "革吉县", "革吉镇", "林芝县人民政府驻地由林芝镇迁至八一镇", "普兰县", "普兰镇", "日土县", "日土镇", "狮泉河镇", "托林镇", "札达县"]
    }, {
        "name": "昌都地区",
        "districtAndCounty": ["八宿县", "白玛镇", "边坝县", "草卡镇", "察雅县", "昌都县", "城关镇", "丁青县", "丁青镇", "嘎托镇", "贡觉县", "江达县", "江达镇", "类乌齐县", "洛隆县", "芒康县", "莫洛镇", "桑多镇", "旺达镇", "烟多镇", "孜托镇", "左贡县"]
    }, {
        "name": "拉萨市",
        "districtAndCounty": ["城关区", "达孜县", "当曲卡镇", "当雄县", "德庆镇", "东嘎镇", "堆龙德庆县", "甘丹曲果镇", "工卡镇", "林周县", "墨竹工卡县", "尼木县", "曲水县", "曲水镇", "塔荣镇"]
    }, {
        "name": "林芝地区",
        "districtAndCounty": ["八一镇", "波密县", "察隅县", "工布江达县", "工布江达镇", "朗县", "朗镇", "林芝县", "米林县", "米林镇", "墨脱县", "墨脱镇", "扎木镇", "竹瓦根镇"]
    }, {
        "name": "那曲地区",
        "districtAndCounty": ["阿扎镇", "安多县", "巴青县", "班戈县", "比如县", "比如镇", "嘉黎县", "拉西镇", "那曲县", "那曲镇", "尼玛县", "尼玛镇", "聂荣县", "聂荣镇", "帕那镇", "普保镇", "申扎县", "申扎镇", "索县", "亚拉镇"]
    }, {
        "name": "日喀则地区",
        "districtAndCounty": ["昂仁县", "白朗县", "德吉林镇", "定结县", "定日县", "岗巴县", "岗巴镇", "吉隆县", "加加镇", "江嘎镇", "江孜县", "江孜镇", "卡嘎镇", "卡嘎镇", "康马县", "康马镇", "拉让乡", "拉孜县", "洛江镇", "南木林县", "南木林镇", "聂拉木县", "聂拉木镇", "曲下镇", "仁布县", "日喀则市", "萨嘎县", "萨迦县", "萨迦镇", "下司马镇", "协格尔镇", "谢通门县", "亚东县", "仲巴县", "宗嘎镇"]
    }, {
        "name": "山南地区",
        "districtAndCounty": ["安绕镇", "措美县", "措美镇", "错那县", "错那镇", "贡嘎县", "吉雄镇", "加查县", "浪卡子县", "浪卡子镇", "隆子县", "隆子镇", "洛扎县", "洛扎镇", "乃东县", "琼结县", "琼结镇", "曲松县", "曲松镇", "桑日县", "桑日镇", "泽当镇", "扎囊县", "扎塘镇"]
    }]
}, {
    "name": "香港",
    "city": [{
        "name": "香港特别行政区",
        "districtAndCounty": ["北区", "大埔区", "东区", "观塘区", "黄大仙区", "九龙城区", "葵青区", "离岛区", "南区", "荃湾区", "沙田区", "深水埗区", "屯门区", "湾仔区", "西贡区", "油尖旺区", "元朗区", "中西区"]
    }]
}, {
    "name": "新疆",
    "city": [{
        "name": "阿克苏地区",
        "districtAndCounty": ["阿克苏市", "阿瓦提县", "阿瓦提镇", "拜城县", "拜城镇", "柯坪县", "柯坪镇", "库车县", "库车镇", "沙雅县", "沙雅镇", "温宿县", "温宿镇", "乌什县", "乌什镇", "新和县", "新和镇"]
    }, {
        "name": "阿勒泰地区",
        "districtAndCounty": ["阿勒泰市", "布尔津县", "布尔津镇", "福海县", "富蕴县", "哈巴河县", "吉木乃县", "库额尔齐斯镇", "青河县"]
    }, {
        "name": "巴音郭楞州",
        "districtAndCounty": ["博湖县", "博湖镇", "和静县", "和静镇", "和硕县", "库尔勒市", "轮台县", "轮台镇", "且末县", "且末镇", "若羌县", "若羌镇", "特吾里克镇", "尉犁县", "尉犁镇", "焉耆回族自治县", "焉耆镇"]
    }, {
        "name": "博尔塔拉州",
        "districtAndCounty": ["博格达尔镇", "博乐市", "精河县", "精河镇", "温泉县"]
    }, {
        "name": "昌吉州",
        "districtAndCounty": ["昌吉市", "阜康市", "呼图壁县", "呼图壁镇", "吉木萨尔县", "吉木萨尔镇", "玛纳斯县", "玛纳斯镇", "米泉市", "木垒哈萨克自治县", "木垒镇", "奇台县", "奇台镇"]
    }, {
        "name": "哈密地区",
        "districtAndCounty": ["巴里坤哈萨克自治县", "巴里坤镇", "哈密市", "伊吾县", "伊吾镇"]
    }, {
        "name": "和田地区",
        "districtAndCounty": ["策勒县", "策勒镇", "固玛镇", "和田市", "和田县", "喀拉喀什镇", "洛浦县", "洛浦镇", "民丰县", "墨玉县", "木尕拉镇", "尼雅镇", "皮山县", "于田县"]
    }, {
        "name": "喀什地区",
        "districtAndCounty": ["巴楚县", "巴楚镇", "巴仁镇", "伽师县", "喀格勒克镇", "喀什市", "麦盖提县", "麦盖提镇", "莎车县", "莎车镇", "疏附县", "疏勒县", "疏勒镇", "塔什库尔干塔吉克自治县", "塔什库尔干镇", "托克扎克镇", "叶城县", "英吉沙县", "英吉沙镇", "岳普湖县", "岳普湖镇", "泽普县", "泽普镇"]
    }, {
        "name": "克拉玛依市",
        "districtAndCounty": ["白碱滩区", "独山子区", "克拉玛依区", "乌尔禾区"]
    }, {
        "name": "克孜勒苏柯州",
        "districtAndCounty": ["阿合奇县", "阿合奇镇", "阿克陶县", "阿克陶镇", "阿图什市", "乌恰县", "乌恰镇"]
    }, {
        "name": "塔城地区",
        "districtAndCounty": ["额敏县", "额敏镇", "哈拉布拉镇", "和布克赛尔蒙古自治县", "和布克赛尔镇", "三道河子镇", "沙湾县", "塔城市", "托里县", "托里镇", "乌苏市", "裕民县"]
    }, {
        "name": "吐鲁番地区",
        "districtAndCounty": ["鄯善县", "鄯善镇", "吐鲁番市", "托克逊县", "托克逊镇"]
    }, {
        "name": "乌鲁木齐市",
        "districtAndCounty": ["达坂城区", "东山区", "沙依巴克区", "水磨沟区", "天山区", "头屯河区", "乌鲁木齐市水磨沟区", "乌鲁木齐县", "新市区"]
    }, {
        "name": "伊犁州",
        "districtAndCounty": ["察布查尔锡伯自治县", "察布查尔镇", "巩留县", "巩留镇", "霍城县", "吉里于孜镇", "奎屯市", "尼勒克县", "尼勒克镇", "水定镇", "特克斯县", "特克斯镇", "新源县", "新源镇", "伊宁市", "伊宁县", "昭苏县", "昭苏镇"]
    }, {
        "name": "自治区直辖县级行政单位",
        "districtAndCounty": ["阿拉尔市", "石河子市", "图木舒克市", "五家渠市"]
    }]
}, {
    "name": "云南省",
    "city": [{
        "name": "保山市",
        "districtAndCounty": ["昌宁县", "甸阳镇", "龙陵县", "龙山镇", "隆阳区", "施甸县", "腾冲县", "腾越镇", "田园镇"]
    }, {
        "name": "楚雄州",
        "districtAndCounty": ["楚雄市", "大姚县", "栋川镇", "共和镇", "金碧镇", "金山镇", "龙川镇", "禄丰县", "牟定县", "南华县", "狮山镇", "双柏县", "妥甸镇", "武定县", "姚安县", "永定镇", "永仁县", "元马镇", "元谋县"]
    }, {
        "name": "大理州",
        "districtAndCounty": ["宾川县", "博南镇", "苍山西镇", "茈碧湖镇", "大理市", "洱源县", "鹤庆县", "剑川县", "金华镇", "金牛镇", "弥城镇", "弥渡县", "南涧彝族自治县", "南涧镇", "南诏镇", "诺邓镇", "巍山彝族回族自治县", "祥城镇", "祥云县", "漾濞彝族自治县", "永平县", "云鹤镇", "云龙县"]
    }, {
        "name": "德宏州",
        "districtAndCounty": ["梁河县", "陇川县", "潞西市", "平原镇", "瑞丽市", "盈江县", "章凤镇", "遮岛镇"]
    }, {
        "name": "迪庆州",
        "districtAndCounty": ["保和镇", "德钦县", "建塘镇", "升平镇", "维西傈僳族自治县", "香格里拉县"]
    }, {
        "name": "红河州",
        "districtAndCounty": ["大兴镇", "个旧市", "河口瑶族自治县", "河口镇", "红河县", "建水县", "金河镇", "金平苗族瑶族傣族自治县", "开远市", "临安镇", "泸西县", "绿春县", "蒙自县", "弥勒县", "弥阳镇", "南沙镇", "屏边苗族自治县", "石屏县", "文澜镇", "迤萨镇", "异龙镇", "玉屏镇", "元阳县", "中枢镇"]
    }, {
        "name": "昆明市",
        "districtAndCounty": ["安宁市", "呈贡县", "东川区", "富民县", "官渡区", "晋宁县", "匡远镇", "昆阳镇", "龙城镇", "鹿阜镇", "禄劝彝族苗族自治县", "盘龙区", "屏山镇", "仁德镇", "石林彝族自治县", "嵩明县", "嵩阳镇", "五华区", "西山区", "寻甸回族彝族自治县", "宜良县", "永定镇"]
    }, {
        "name": "丽江市",
        "districtAndCounty": ["大兴镇", "古城区", "华坪县", "黄山镇", "宁蒗彝族自治县", "永北镇", "永胜县", "玉龙纳西族自治县", "中心镇"]
    }, {
        "name": "临沧市",
        "districtAndCounty": ["爱华镇", "沧源佤族自治县", "德党镇", "凤庆县", "凤山镇", "耿马傣族佤族自治县", "耿马镇", "临翔区", "勐董镇", "勐勐镇", "南伞镇", "双江拉祜族佤族布朗族傣族自治县", "永德县", "云县", "镇康县"]
    }, {
        "name": "怒江州",
        "districtAndCounty": ["茨开镇", "福贡县", "贡山独龙族怒族自治县", "金顶镇", "兰坪白族普米族自治县", "六库镇", "泸水县", "泸水县六库镇", "上帕镇"]
    }, {
        "name": "曲靖市",
        "districtAndCounty": ["丹凤镇", "富源县", "会泽县", "金钟镇", "陆良县", "罗平县", "罗雄镇", "马龙县", "麒麟区", "师宗县", "通泉镇", "西平镇", "宣威市", "沾益县", "中安镇", "中枢镇"]
    }, {
        "name": "思茅市",
        "districtAndCounty": ["翠云区", "恩乐镇", "江城哈尼族彝族自治县", "锦屏镇", "景东彝族自治县", "景谷傣族彝族自治县", "澜沧拉祜族自治县", "联珠镇", "勐朗镇", "勐烈镇", "勐梭镇", "孟连傣族拉祜族佤族自治县", "墨江哈尼族自治县", "娜允镇", "宁洱镇", "普洱哈尼族彝族自治县", "威远镇", "西盟佤族自治县", "镇沅彝族哈尼族拉祜族自治县"]
    }, {
        "name": "文山州",
        "districtAndCounty": ["富宁县", "广南县", "江那镇", "锦屏镇", "开化镇", "莲城镇", "麻栗坡县", "麻栗镇", "马白镇", "马关县", "丘北县", "文山县", "西畴县", "西洒镇", "新华镇", "砚山县"]
    }, {
        "name": "西双版纳州",
        "districtAndCounty": ["景洪市", "勐海县", "勐海镇", "勐腊县", "勐腊镇"]
    }, {
        "name": "玉溪市",
        "districtAndCounty": ["澄江县", "大街镇", "峨山彝族自治县", "凤麓镇", "桂山镇", "红塔区", "华宁县", "江川县", "澧江镇", "龙泉镇", "宁州镇", "双江镇", "通海县", "新平彝族傣族自治县", "秀山镇", "易门县", "元江哈尼族彝族傣族自治县"]
    }, {
        "name": "昭通市",
        "districtAndCounty": ["翠华镇", "大关县", "角奎镇", "鲁甸县", "巧家县", "水富县", "绥江县", "威信县", "文屏镇", "乌峰镇", "溪落渡镇", "向家坝镇", "新华镇", "盐津县", "盐井镇", "彝良县", "永善县", "扎西镇", "昭阳区", "镇雄县", "中城镇"]
    }]
}, {
    "name": "浙江省",
    "city": [{
        "name": "杭州市",
        "districtAndCounty": ["滨江区", "淳安县", "富阳市", "拱墅区", "建德市", "江干区", "临安市", "千岛湖镇", "上城区", "桐庐县", "西湖区", "下城区", "萧山区", "余杭区"]
    }, {
        "name": "湖州市",
        "districtAndCounty": ["安吉县", "德清县", "递铺镇", "南浔区", "吴兴区", "武康镇", "长兴县", "雉城镇"]
    }, {
        "name": "嘉兴市",
        "districtAndCounty": ["海宁市", "海盐县", "嘉善县", "南湖区", "平湖市", "桐乡市", "魏塘镇", "武原镇", "秀洲区"]
    }, {
        "name": "金华市",
        "districtAndCounty": ["安文镇", "东阳市", "金东区", "兰溪市", "磐安县", "浦江县", "武义县", "婺城区", "义乌市", "永康市"]
    }, {
        "name": "丽水市",
        "districtAndCounty": ["鹤城镇", "鹤溪镇", "缙云县", "景宁畲族自治县", "莲都区", "龙泉市", "妙高镇", "青田县", "庆元县", "松阳县", "松源镇", "遂昌县", "五云镇", "西屏镇", "云和县", "云和镇"]
    }, {
        "name": "宁波市",
        "districtAndCounty": ["北仑区", "慈溪市", "奉化市", "海曙区", "江北区", "江东区", "宁海县", "象山县", "鄞州区", "余姚市", "镇海区"]
    }, {
        "name": "衢州市",
        "districtAndCounty": ["常山县", "城关镇", "江山市", "开化县", "柯城区", "龙游县", "衢江区", "天马镇"]
    }, {
        "name": "绍兴市",
        "districtAndCounty": ["城关镇", "上虞市", "绍兴县", "嵊州市", "新昌县", "越城区", "诸暨市"]
    }, {
        "name": "台州市",
        "districtAndCounty": ["海游镇", "黄岩区", "椒江区", "临海市", "路桥区", "三门县", "天台县", "温岭市", "仙居县", "玉环县", "珠港镇"]
    }, {
        "name": "温州市",
        "districtAndCounty": ["北岙镇", "苍南县", "大峃镇", "洞头县", "昆阳镇", "乐清市", "灵溪镇", "龙湾区", "鹿城区", "罗阳镇", "瓯海区", "平阳县", "瑞安市", "上塘镇", "泰顺县", "文成县", "永嘉县"]
    }, {
        "name": "舟山市",
        "districtAndCounty": ["菜园镇", "岱山县", "定海区", "高亭镇", "普陀区", "嵊泗县"]
    }]
}]




